Examinator/src/Catalogs/ВариантыЗаданийСУО/ВариантыЗаданийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыЗаданийСУО</name>
  <owners>Catalog.ЗаданияСУО</owners>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтандартныеНастройкиТеста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтраницВопросов</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьСтраницыВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ВариантыЗаданийСУО/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// СтраницаНеЭлектронноеЗадание
	
	Если ЭлектронноеМероприятие Тогда
		Элементы.СтраницаНеЭлектронноеЗадание.Видимость = Ложь;
	Иначе
		Элементы.СтраницаНеЭлектронноеЗадание.Видимость = Истина;
	КонецЕсли;
	
	// СтраницаЭлектронноеЗадание
	
	Если ЭлектронноеМероприятие Тогда
		Элементы.СтраницаЭлектронноеЗадание.Видимость = Истина;
	Иначе
		Элементы.СтраницаЭлектронноеЗадание.Видимость = Ложь;
	КонецЕсли;
	
	// СтраницаЗаданиеНаОсновеЭлектронногоРесурса
	
	Если ЭлектронноеМероприятие И НаОсновеЭлектронногоРесурса Тогда
		Элементы.СтраницаЗаданиеНаОсновеЭлектронногоРесурса.Видимость = Истина;
	Иначе
		Элементы.СтраницаЗаданиеНаОсновеЭлектронногоРесурса.Видимость = Ложь;
		Объект.ЭлектронныйРесурс = ПредопределенноеЗначение("Справочник.СводыЗнанийСУЗ.ПустаяСсылка");
		Объект.Фрагмент          = ПредопределенноеЗначение("Справочник.СодержаниеСУЗ.ПустаяСсылка");
	КонецЕсли;
	
	// ИспользоватьСтандартныеНастройкиТеста
	
	Если ЗначениеЗаполнено(Объект.Фрагмент)
		И ТипЗнч(Объект.Фрагмент.СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ")
		И Объект.Фрагмент.СсылкаНаЭлемент.ЭтоТест Тогда
		
		Элементы.ИспользоватьСтандартныеНастройкиТеста.Доступность = Истина;
		
	Иначе
		
		Элементы.ИспользоватьСтандартныеНастройкиТеста.Доступность = Ложь;
		
	КонецЕсли;
	
	// ГруппаНастройкиТеста
	
	Если ЗначениеЗаполнено(Объект.Фрагмент)
		И НЕ Объект.ИспользоватьСтандартныеНастройкиТеста Тогда
		Элементы.ГруппаНастройкиТеста.Доступность = Истина;
	Иначе
		Элементы.ГруппаНастройкиТеста.Доступность = Ложь;	
	КонецЕсли;
	
	
	// ПереходитьВпередАвтоматически
	
	Если НЕ Объект.ПоказыватьНавигацию Тогда
		Элементы.ПереходитьВпередАвтоматически.ТолькоПросмотр = Истина;
		Объект.ПереходитьВпередАвтоматически = Истина;
	Иначе
		Элементы.ПереходитьВпередАвтоматически.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитВидаМероприятия(Задание)
	
	СтруктураРеквизитов = Новый Структура;
	
	Если ТипЗнч(Задание.Владелец) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		
		Мероприятие = Задание.Владелец;
		
		СтруктураРеквизитов.Вставить("ЭлектронноеМероприятие", Мероприятие.Вид.Электронное); 
		СтруктураРеквизитов.Вставить("ТребуетсяПреподаватель", Мероприятие.Вид.ТребуетсяПреподаватель); 
		СтруктураРеквизитов.Вставить("НаОсновеЭлектронногоРесурса", Задание.НаОсновеЭлектронногоРесурса); 
		
	Иначе
		
		СтруктураРеквизитов.Вставить("ЭлектронноеМероприятие", Истина); 
		СтруктураРеквизитов.Вставить("ТребуетсяПреподаватель", Истина); 
		СтруктураРеквизитов.Вставить("НаОсновеЭлектронногоРесурса", Задание.НаОсновеЭлектронногоРесурса);
		
	КонецЕсли;
		
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФрагментЭлектронногоРесурса(ЭлектронныйРесурс)
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Возврат Справочники.СодержаниеСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеСУЗ.Ссылка
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		Возврат Справочники.СодержаниеСУЗ.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		
		СтруктураПараметровМероприятия = ПолучитьРеквизитВидаМероприятия(Объект.Владелец);
		
		ЭлектронноеМероприятие      = СтруктураПараметровМероприятия.ЭлектронноеМероприятие;
		ТребуетсяПреподаватель      = СтруктураПараметровМероприятия.ТребуетсяПреподаватель;
		НаОсновеЭлектронногоРесурса = СтруктураПараметровМероприятия.НаОсновеЭлектронногоРесурса;
		
		// Примечание: для новых объектов алгоритм получения этих данных другой.
		// См. обработчик события ПриОткрытии.
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Для новых объектов получаем параметры мероприятия при помощи функции
	// ПолучитьРеквизитВидаМероприятия, так как при создании на сервере формы
	// Мы еще не знаем для какого мероприятия создается задание.
	
	Если Объект.Ссылка.Пустая() Тогда
		
		СтруктураПараметровМероприятия = ПолучитьРеквизитВидаМероприятия(Объект.Владелец);
		
		ЭлектронноеМероприятие      = СтруктураПараметровМероприятия.ЭлектронноеМероприятие;
		ТребуетсяПреподаватель      = СтруктураПараметровМероприятия.ТребуетсяПреподаватель;
		НаОсновеЭлектронногоРесурса = СтруктураПараметровМероприятия.НаОсновеЭлектронногоРесурса;
		
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ИзменитьПродолжительность(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НачальноеЗначение", Объект.ПродолжительностьВСекундах);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПродолжительностьПродолжение", ЭтотОбъект);		
	
	ОткрытьФорму("ОбщаяФорма.ВводПериодаСУ", ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПродолжительностьПродолжение(НоваяСтруктураПериода, ДополнительныеПараметры) Экспорт
	
	Если НоваяСтруктураПериода <> Неопределено Тогда
		
		Объект.ПродолжительностьВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(НоваяСтруктураПериода);
		Объект.Продолжительность = ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(Объект.ПродолжительностьВСекундах);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ФрагментПриИзменении(Элемент=Неопределено)
	
	Объект.ИспользоватьСтандартныеНастройкиТеста = Истина;
	
	УстановитьДоступностьЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтандартныеНастройкиТестаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНавигациюПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйРесурсПриИзменении(Элемент)
	
	Объект.Фрагмент = ПолучитьФрагментЭлектронногоРесурса(Объект.ЭлектронныйРесурс);
	
	ФрагментПриИзменении();

КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(Объект.ЭлектронныйРесурс);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
